In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\apoorv singh negi\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: pytz>=2017.2 in c:\users\apoorv singh negi\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\apoorv singh negi\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\apoorv singh negi\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in c:\users\apoorv singh negi\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [12]:
import pandas as pd
import numpy as np

In [21]:
user_data = {
     "MarksA":np.random.randint(1,100,5),
     "MarksB":np.random.randint(50,100,5),
     "MarksC":np.random.randint(1,100,5)
    
}

In [22]:
user_data

{'MarksA': array([67,  7, 37,  5, 75]),
 'MarksB': array([78, 69, 72, 82, 81]),
 'MarksC': array([20, 69, 58, 21, 28])}

In [28]:
df = pd.DataFrame(user_data, dtype = 'float32')

In [29]:
print(df)

   MarksA  MarksB  MarksC
0    67.0    78.0    20.0
1     7.0    69.0    69.0
2    37.0    72.0    58.0
3     5.0    82.0    21.0
4    75.0    81.0    28.0

In [26]:
df.head(n=3)#represent on first 3 rows of our table

   MarksA  MarksB  MarksC
0      67      78      20
1       7      69      69
2      37      72      58

In [27]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [30]:
 df.to_csv('marks.csv')

In [33]:
my_data = pd.read_csv('marks.csv')
my_data = my_data.drop(columns = ['Unnamed: 0'])#dropping a particular column
my_data

   MarksA  MarksB  MarksC
0    67.0    78.0    20.0
1     7.0    69.0    69.0
2    37.0    72.0    58.0
3     5.0    82.0    21.0
4    75.0    81.0    28.0

In [34]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   38.200000  76.400000  39.200000
std    32.637402   5.683309  22.731036
min     5.000000  69.000000  20.000000
25%     7.000000  72.000000  21.000000
50%    37.000000  78.000000  28.000000
75%    67.000000  81.000000  58.000000
max    75.000000  82.000000  69.000000

In [35]:
df.iloc[3]# row no 3

MarksA     5.0
MarksB    82.0
MarksC    21.0
Name: 3, dtype: float32

In [36]:
df.iloc[3,1]# row no 3 and column 1

82.0

In [37]:
df.iloc[3][1]#row 3 column 1

82.0

In [41]:
idx= [df.columns.get_loc('MarksB'), df.columns.get_loc('MarksC')]# index of a particular column
print(idx)
df.iloc[3,idx]

[1, 2]

MarksB    82.0
MarksC    21.0
Name: 3, dtype: float32

In [42]:
df.iloc[:3, idx]

   MarksB  MarksC
0    78.0    20.0
1    69.0    69.0
2    72.0    58.0

In [43]:
my_data

   MarksA  MarksB  MarksC
0    67.0    78.0    20.0
1     7.0    69.0    69.0
2    37.0    72.0    58.0
3     5.0    82.0    21.0
4    75.0    81.0    28.0

In [47]:
my_data.sort_values(by=["MarksA"], ascending=False) #sort marksA in ascending order

   MarksA  MarksB  MarksC
4    75.0    81.0    28.0
0    67.0    78.0    20.0
2    37.0    72.0    58.0
1     7.0    69.0    69.0
3     5.0    82.0    21.0

In [46]:
my_data.sort_values(by=["MarksB"])# by default sort in ascending order

   MarksA  MarksB  MarksC
1     7.0    69.0    69.0
2    37.0    72.0    58.0
0    67.0    78.0    20.0
4    75.0    81.0    28.0
3     5.0    82.0    21.0

In [50]:
data_array=my_data.values #convert to normal numpy array from df

In [49]:
data_array

array([[67., 78., 20.],
       [ 7., 69., 69.],
       [37., 72., 58.],
       [ 5., 82., 21.],
       [75., 81., 28.]])

In [53]:
new_df = pd.DataFrame(data_array, dtype='int32',columns=["physics","chem","maths"]) #numpy to df convsersion

In [52]:
new_df

   physics  chem  maths
0       67    78     20
1        7    69     69
2       37    72     58
3        5    82     21
4       75    81     28